{
  "backend/main.mo": "Actor defines message handling, user profiles, FAQ suggestions, and anonymized learning signals with access‑controlled queries and updates.",
  "feature_evidence.json": "Lists features, related source files, components, tests, and confidence levels for the project’s feature evidence report.",
  "frontend-file-summaries.txt": "Contains prewritten one‑sentence descriptions of various frontend files for documentation or build planning.",
  "frontend/index.css": "Defines global Tailwind styles and OKLCH color variables for light and dark themes with RTL-friendly base rules.",
  "frontend/index.html": "Main HTML entry with Persian language and RTL direction settings pointing to the React app root.",
  "frontend/src/App.tsx": "Root React component handling authentication, profile setup, navigation, and themed rendering of main pages.",
  "frontend/src/components/auth/AdminGuard.tsx": "Empty placeholder file for an admin-guard component.",
  "frontend/src/components/auth/AdminUnlockDialog.tsx": "Empty placeholder file for an admin unlock dialog component.",
  "frontend/src/components/auth/AuthGate.tsx": "Unauthenticated landing screen providing Persian UI text and an Internet Identity login button.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button managing Internet Identity sessions and React Query cache behavior.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting new users to enter a name and save their profile with Persian UI text.",
  "frontend/src/components/branding/BrandHeader.tsx": "Header displaying app branding, Persian tagline, optional user greeting, and login button.",
  "frontend/src/components/chat/ChatComposer.tsx": "Provides a message input with send button handling async sending, disabled states, and enter-to-send behavior.",
  "frontend/src/components/chat/ChatMessageList.tsx": "Renders chat messages with user/mama detection, timestamp formatting, and directional styling based on author.",
  "frontend/src/components/chat/HeartbeatPipelineIndicator.tsx": "Displays pipeline processing steps with status icons, failure state, and optional dismiss button.",
  "frontend/src/components/chat/PrivacyPreservingLearningToggle.tsx": "Empty placeholder file with no implementation.",
  "frontend/src/components/external-knowledge/ExternalKnowledgePanel.tsx": "Fetches and displays Wikipedia summaries with loading, error handling, and external link support.",
  "frontend/src/components/layout/AppLayout.tsx": "Defines the main app layout with navigation, header, background styling, and footer.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, invalidating queries when the actor updates.",
  "frontend/src/hooks/useActorReadiness.ts": "Determines actor readiness state based on authentication and fetch status, exposing derived flags.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context and login/clear logic, loading stored identities and managing auth state.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for user profiles, messages, sending messages, and FAQ operations using actor-based backend calls.",
  "frontend/src/hooks/useWikipediaSummary.ts": "Implements a query hook that searches Wikipedia and returns a page summary for a given search term.",
  "frontend/src/index.css": "Defines Tailwind layers and custom CSS variables for dark and light themes with detailed color tokens.",
  "frontend/src/lib/mamaAngles.ts": "Generates deterministic response angle candidates based on message features and selects primary angles with anti-repetition.",
  "frontend/src/lib/mamaBrain.ts": "Creates empathetic or FAQ-based Mama responses using deterministic template selection and Persian text normalization.",
  "frontend/src/lib/mamaDepthTemplates.ts": "Provides structured deep-response templates for each angle type and generates detailed responses deterministically.",
  "frontend/src/lib/mamaPipeline.ts": "Runs a deterministic 7‑step pipeline to process user messages with keyboard correction, FAQ search, emotional analysis, angle/depth selection, and response generation.",
  "frontend/src/lib/mamaSelectionBias.ts": "Computes angle-selection bias from aggregate stats and applies weighted adjustments to candidate priorities.",
  "frontend/src/main.tsx": "Bootstraps the React app with query client and Internet Identity context before rendering App.",
  "frontend/src/pages/admin/AdminFaqImportPage.tsx": "Empty placeholder page for FAQ import functionality.",
  "frontend/src/pages/admin/AdminFaqSuggestionsPage.tsx": "Empty placeholder page for FAQ suggestion management.",
  "frontend/src/pages/ChatPage.tsx": "Implements the chat UI and message flow, invoking the Mama pipeline and managing authentication, queries, and feedback state.",
  "frontend/src/pages/MamaBrainPage.tsx": "Displays a descriptive overview of the Mama system’s architecture and modules with styled UI cards.",
  "frontend/src/pages/TransparencyPage.tsx": "Shows live transparency metrics, public messages, and aggregate stats with periodic auto-refresh.",
  "frontend/src/utils/chatErrors.ts": "Provides structured error classification, user-friendly messages, and sanitized debug logging.",
  "frontend/src/utils/perf.ts": "Development-only performance timers for measuring async and sync function durations without exposing user content.",
  "frontend/src/utils/persianKeyboardCorrection.ts": "Provides heuristics to detect Persian text typed on an English keyboard and converts characters using an English‑to‑Persian mapping.",
  "frontend/src/utils/persianText.ts": "Normalizes Persian text spacing and punctuation, enforces the ماما prefix, and sanitizes prompts for safe metadata storage.",
  "frontend/src/utils/privacyPreservingSignals.ts": "Generates anonymized, non‑reversible learning signals from normalized messages using keyword‑based categories and length/question metrics.",
  "frontend/src/utils/urlParams.ts": "Utility for extracting, storing, persisting, and clearing URL and session parameters, including hash‑based routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, typography, animations, and container settings with plugins.",
  "project_state.json": "Describes the project’s state, goals, features, and pending requests related to automatic angle expansion and self‑improving Mama responses."
}