{
  "backend/main.mo": "Motoko canister handling user profiles, public/private messages, permissions, and opt‑in privacy‑preserving learning with anonymized signals.",
  "feature_evidence.json": "Feature evidence report listing implemented features, related files, components, and test IDs for the project.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and functionality of all major frontend files.",
  "frontend/index.css": "Global Tailwind CSS theme definitions with OKLCH colors, dark mode defaults, and base layout styling.",
  "frontend/index.html": "HTML entry point setting Persian language and RTL direction for the React app.",
  "frontend/src/App.tsx": "Main React app component managing authentication, profile setup, theme, and navigation between all core pages.",
  "frontend/src/components/auth/AdminGuard.tsx": "Wrapper component that checks admin permissions and blocks access with an error state if unauthorized.",
  "frontend/src/components/auth/AuthGate.tsx": "Login gateway showing Persian-themed sign‑in UI and initiating Internet Identity authentication.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button handling authentication, cache clearing, and query invalidation with Persian UI text.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting authenticated users to enter and save their display name during initial profile setup.",
  "frontend/src/components/branding/BrandHeader.tsx": "Header showing login button, optional username greeting, and brand logo/title.",
  "frontend/src/components/chat/ChatComposer.tsx": "Message input with send button handling sending state, enter-to-send, and connection indicators.",
  "frontend/src/components/chat/ChatMessageList.tsx": "Renders chat messages with user/bot styling, timestamps, and identity-based alignment.",
  "frontend/src/components/chat/HeartbeatPipelineIndicator.tsx": "Displays pipeline step statuses with icons, progress states, and optional dismissal.",
  "frontend/src/components/chat/PrivacyPreservingLearningToggle.tsx": "Toggle card for enabling or disabling privacy-preserving learning via backend mutations.",
  "frontend/src/components/external-knowledge/ExternalKnowledgePanel.tsx": "Fetches and displays Wikipedia summaries with loading, error, and empty states.",
  "frontend/src/components/layout/AppLayout.tsx": "Main app layout with header, navigation, content area, and footer; adapts items for admins.",
  "frontend/src/hooks/useActor.ts": "Creates and manages authenticated or anonymous backend actors, refreshing queries on change.",
  "frontend/src/hooks/useActorReadiness.ts": "Determines actor readiness status based on identity and actor loading state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context with login, logout, and identity loading management.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user profiles, messages, FAQ actions, and admin checks, wiring them to actor methods with cache invalidation.",
  "frontend/src/hooks/useWikipediaSummary.ts": "Provides a query hook that searches Wikipedia and returns a page summary for a given user query.",
  "frontend/src/index.css": "Sets up Tailwind layers and defines CSS variables for dark and light themes, including colors for UI elements and charts.",
  "frontend/src/lib/mamaBrain.ts": "Implements deterministic empathetic response generation with Persian normalization and structures for Mama AI responses and feedback.",
  "frontend/src/lib/mamaPipeline.ts": "Runs a deterministic multi-step pipeline for message processing, including keyboard correction, FAQ lookup, emotional analysis, and response selection.",
  "frontend/src/main.tsx": "Initializes the React app, wrapping it with Internet Identity and React Query providers.",
  "frontend/src/pages/admin/AdminFaqImportPage.tsx": "Provides an admin interface to batch‑import FAQ items from JSON. Processes entries in small batches with progress tracking and error handling.",
  "frontend/src/pages/ChatPage.tsx": "Implements the main chat interface, handling message sending, pipeline execution, authentication checks, and UI state for private/public chat.",
  "frontend/src/pages/MamaBrainPage.tsx": "Renders a page describing the Mama Brain architecture with seven modules and a story section. Uses cards and icons to display module details and decorative background imagery.",
  "frontend/src/pages/TransparencyPage.tsx": "Shows transparency dashboard with chat statistics and recent public messages. Fetches counts and messages via hooks and refreshes data on demand.",
  "frontend/src/utils/chatErrors.ts": "Classifies errors into types and generates safe user‑friendly messages. Also creates sanitized debug logs without sensitive fields.",
  "frontend/src/utils/perf.ts": "Adds development‑only performance timers for async and sync functions. Includes a PerfTimer class for manual timing and logging.",
  "frontend/src/utils/persianKeyboardCorrection.ts": "Detects Persian typed with an English keyboard and converts characters using a mapping. Returns corrected text with a flag indicating changes.",
  "frontend/src/utils/persianText.ts": "Normalizes Persian text spacing and punctuation, enforces a Mama prefix, and sanitizes prompts. Includes ZWNJ rules for common patterns.",
  "frontend/src/utils/privacyPreservingSignals.ts": "Generates anonymized aggregate signals from normalized messages using keyword categories and length buckets. No raw text is returned.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash routing), store/retrieve them in sessionStorage, and persist or clear parameters as needed.",
  "frontend/tailwind.config.js": "Tailwind configuration defining dark mode, content paths, extended theme colors/fonts/animations, and enabling typography, container queries, and animation plugins.",
  "project_state.json": "Tracks the project’s overall design, architecture notes, requirements, issues, and versioned features for the Persian AI chatbot Mama."
}