{
  "backend/main.mo": "Motoko canister managing user profiles, public and private messages, authorization checks, FAQs, and timestamp-based message fetching.",
  "feature_evidence.json": "Feature evidence report listing implemented features, related files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "JSON-like summary map describing the purpose of each frontend file in the project.",
  "frontend/index.css": "Global Tailwind-based dark-mode theme with OKLCH variables and RTL-friendly base styles.",
  "frontend/index.html": "HTML entry point enabling Persian language and RTL layout, loading the React app root.",
  "frontend/src/App.tsx": "Main React app handling authentication, profile setup, navigation, and page rendering under a dark theme provider.",
  "frontend/src/components/auth/AdminGuard.tsx": "Component that checks admin status and either renders children or shows an access-denied alert.",
  "frontend/src/components/auth/AuthGate.tsx": "Login screen with Persian UI that triggers Internet Identity authentication and shows a branded welcome view.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button managing authentication flow, query cache clearing, and toast notifications.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting authenticated users to enter a name, saving profiles with validation and toasts.",
  "frontend/src/components/branding/BrandHeader.tsx": "Renders the app header with login button, optional username greeting, and brand logo/title.",
  "frontend/src/components/chat/ChatComposer.tsx": "Provides a textarea and send button for composing chat messages with Enter-to-send behavior and async send handling.",
  "frontend/src/components/chat/ChatMessageList.tsx": "Displays chat messages with user/bot avatars, alignment based on author, and localized timestamps.",
  "frontend/src/components/chat/HeartbeatPipelineIndicator.tsx": "Shows a visual indicator of pipeline step status with icons, animations, and optional dismiss action.",
  "frontend/src/components/external-knowledge/ExternalKnowledgePanel.tsx": "Fetches and displays a Wikipedia summary for a query, handling loading, errors, and link to full article.",
  "frontend/src/components/layout/AppLayout.tsx": "Defines the main app layout with navigation, header, content area, and footer, adapting options for admins.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on identity, refreshing dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, handling login, stored identity loading, and exposing identity state.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user profiles, messages, FAQ interactions, admin checks, and chat stats using an actor backend.",
  "frontend/src/hooks/useWikipediaSummary.ts": "Fetches a Wikipedia summary for a search query using the MediaWiki API and caches results with React Query.",
  "frontend/src/index.css": "Tailwind CSS config defining dark and light theme variables for colors, layout, and UI elements.",
  "frontend/src/lib/mamaBrain.ts": "Implements deterministic FAQ or empathetic response generation with simple hashing and structured feedback.",
  "frontend/src/lib/mamaPipeline.ts": "Runs a 7‑step message‑processing pipeline with keyboard correction, FAQ lookup, emotional analysis, and response selection.",
  "frontend/src/main.tsx": "Bootstraps the React app with Internet Identity and React Query providers.",
  "frontend/src/pages/admin/AdminFaqImportPage.tsx": "Provides an admin interface to batch‑import FAQ items with progress tracking and error handling.",
  "frontend/src/pages/ChatPage.tsx": "Chat UI handling sending messages, running the Mama pipeline, showing feedback, and managing private/public chat modes.",
  "frontend/src/pages/MamaBrainPage.tsx": "Renders a descriptive page of the Mama Brain architecture with module cards and a story section.",
  "frontend/src/pages/TransparencyPage.tsx": "Displays system transparency stats and recent public messages with refreshable metrics.",
  "frontend/src/utils/chatErrors.ts": "Utility for extracting readable error info and producing sanitized debug logs for chat operations.",
  "frontend/src/utils/perf.ts": "Development‑only performance measurement helpers for timing async and sync operations.",
  "frontend/src/utils/persianKeyboardCorrection.ts": "Auto‑detects and converts English‑layout Persian typing into correct Persian characters.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, persisting, and clearing URL and session parameters across navigation.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, content paths, extended color system using OKLCH variables, custom fonts, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines current project state for the Persian AI chatbot «ماما», including vision, architecture notes, known issues, and existing implemented features."
}