{
  "kind": "build_request",
  "title": "Make Mama self-expand response angles and strengthen answer depth automatically",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Implement a fully automatic “angle expansion” layer inside the Mama response pipeline so Mama can generate and choose a new response angle without the user specifying what angles to add.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-8"
        ],
        "quotes": [
          "نه نمیخوام من مشخص کنم ماما دقیقا چه نوع زاویه هایی اضافه بشه بهش! این فرایند باید توست هوش مصنوعی تشخیص داده بشه."
        ]
      },
      "acceptanceCriteria": [
        "When a user sends messages in both Private and Public chat, Mama can respond using multiple internally-generated angles (e.g., clarification, step-by-step guidance, reframing, pros/cons, example, summary, next-steps) without any user configuration UI.",
        "Angle selection is deterministic (works with existing anti-repetition + optional aggregateSeed) and still respects current paths (FAQ match, civic-empowerment, empathetic) instead of breaking them.",
        "The existing pipeline step visualization continues to work; if additional internal logic is added, it must not break current 7-step statuses rendering in ChatPage."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Strengthen Mama’s “Q&A pattern squared” behavior by increasing response depth and creative structure automatically (without adding external AI/LLM dependencies), while keeping responses safe, consistent, and non-repetitive.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-8"
        ],
        "quotes": [
          "«توان ۲ کردن الگوی سؤال‌وجواب» یعنی خلاقیت و عمق پاسخ‌ دادن رو تقویت کنیم. این هم شدنیه."
        ]
      },
      "acceptanceCriteria": [
        "For non-FAQ responses, Mama replies include deeper structure more often (at least one of: short diagnosis, 2–5 actionable steps, reflective question, alternative perspective, or concise summary), while preserving the existing Mama tone and prefix behavior.",
        "Repetition avoidance remains effective: consecutive messages should not select the same template key when a suitable alternative exists (continue using lastTemplateKey and extend template-keying to any new angle templates).",
        "Public chat continues to use backend-provided aggregate variety seed (getAggregateVarietySeed) to diversify deterministic selection across the population."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Make Mama’s self-improvement loop more explicit and robust by expanding privacy-preserving learning signals and using them to influence deterministic angle/template selection over time (no raw private text stored).",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-8"
        ],
        "quotes": [
          "الان سیستم تو نسخه آخر کاملا خودکار یاد می‌گیرد، پس می‌توانم الگوریتمش را طوری طراحی کنم که خودش زاویه‌های جدید بسازد و الگوی پاسخ‌دهی را تقویتی‌تر کند."
        ]
      },
      "acceptanceCriteria": [
        "Private chat continues to automatically derive anonymized signals client-side and store them via storeAnonymizedSignal; no raw message text is ever sent through this learning-signal path.",
        "Backend continues to expose aggregate stats/seed (existing getAllCategoryStats / getAggregateVarietySeed) and does not introduce any endpoint that returns raw private message content.",
        "The frontend uses aggregate stats and/or aggregate seed to adjust deterministic selection among angles/templates (e.g., biasing toward underrepresented categories/angles), and this behavior is observable via changed template-key distribution across repeated test messages (without requiring user settings)."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Extend the Transparency page to include high-level self-improvement indicators derived from existing aggregate statistics (e.g., current aggregate variety seed and a small table of top anonymized categories), without exposing any private message content.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-8"
        ]
      },
      "acceptanceCriteria": [
        "TransparencyPage shows at least: (1) the current aggregate variety seed value, and (2) a list of anonymized categories with counts/averages sourced from backend aggregate stats endpoints.",
        "The UI clearly contains only aggregate/anonymized data; no raw prompts, no per-user private message content, and no identifiers are displayed.",
        "Auto-refresh behavior (existing 15s refresh pattern) continues to work for the new indicators."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo (no additional backend services).",
    "Do not edit any files under frontend/src/components/ui or any path listed in frontend.immutablePaths in SYSTEM_CONTEXT.",
    "Do not add any external AI/LLM integrations or third-party model APIs.",
    "Do not store or return raw private message text as part of the learning/self-improvement mechanism; only anonymized aggregate signals are permitted."
  ],
  "nonGoals": [
    "Building a user-configurable UI for choosing which new angles to add (the system must auto-detect/auto-generate).",
    "Implementing real machine-learning training or model fine-tuning; improvements must be deterministic/heuristic-driven within the existing codebase constraints.",
    "Adding third-party authentication providers beyond Internet Identity.",
    "Adding real-time features like WebSockets."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}