{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Automatic angle expansion + deeper deterministic Mama responses + transparency indicators",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add a fully automatic deterministic “angle expansion” layer to Mama’s response pipeline (no user configuration) while preserving existing FAQ/civic/empathetic paths and the 7-step pipeline UI.",
      "acceptanceCriteria": [
        "When a user sends messages in both Private and Public chat, Mama can respond using multiple internally-generated angles (e.g., clarification, step-by-step guidance, reframing, pros/cons, example, summary, next-steps) without any user configuration UI.",
        "Angle selection is deterministic (works with existing anti-repetition + optional aggregateSeed) and still respects current paths (FAQ match, civic-empowerment, empathetic) instead of breaking them.",
        "The existing pipeline step visualization continues to work; if additional internal logic is added, it must not break current 7-step statuses rendering in ChatPage."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/mamaAngles.ts",
          "operation": "create",
          "description": "Create a deterministic internal “angle expansion” module that (1) derives candidate angles from a normalized user message, (2) selects one or more angles deterministically using message features + optional aggregateSeed, and (3) exposes stable template keys for anti-repetition across all new angles. Keep it UI-less and privacy-preserving (no storage, no raw-text logging)."
        },
        {
          "path": "frontend/src/lib/mamaPipeline.ts",
          "operation": "modify",
          "description": "Integrate the new angle expansion layer into the existing 7-step pipeline without changing step definitions/count. Keep existing routing: civic-empowerment detection remains first, FAQ match remains second, and non-FAQ paths can internally select multiple angles/templates deterministically. Extend anti-repetition so new angle templates also participate via selectedTemplateKey (and any additional internal keys as needed) while keeping the returned PipelineStep list compatible with HeartbeatPipelineIndicator."
        },
        {
          "path": "frontend/src/pages/ChatPage.tsx",
          "operation": "modify",
          "description": "Update pipeline invocation/wiring so both Private and Public chat modes can pass deterministic inputs (lastTemplateKey + public aggregateSeed) to the expanded pipeline and continue to render the same 7-step visualization. Ensure no new user configuration UI is introduced."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Increase non-FAQ response depth/structure (“Q&A pattern squared”) deterministically and safely, preserving Mama tone/prefix and anti-repetition behavior, and continuing to use aggregate variety seed in Public chat.",
      "acceptanceCriteria": [
        "For non-FAQ responses, Mama replies include deeper structure more often (at least one of: short diagnosis, 2–5 actionable steps, reflective question, alternative perspective, or concise summary), while preserving the existing Mama tone and prefix behavior.",
        "Repetition avoidance remains effective: consecutive messages should not select the same template key when a suitable alternative exists (continue using lastTemplateKey and extend template-keying to any new angle templates).",
        "Public chat continues to use backend-provided aggregate variety seed (getAggregateVarietySeed) to diversify deterministic selection across the population."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/mamaDepthTemplates.ts",
          "operation": "create",
          "description": "Add a deterministic library of deeper, structured, non-FAQ response templates (diagnosis/steps/question/reframe/summary/next-steps/pros-cons/examples) with explicit template keys and safety constraints. Ensure templates preserve the existing Mama tone and rely on enforceMamaPrefix/normalizePersianText for consistent output."
        },
        {
          "path": "frontend/src/lib/mamaPipeline.ts",
          "operation": "modify",
          "description": "Augment non-FAQ response generation to compose deeper structured replies more frequently by selecting and combining one or more structures from the new depth templates. Ensure selection remains deterministic with aggregateSeed (Public) and respects anti-repetition by avoiding reuse of the same template key when alternatives exist. Keep FAQ responses unchanged and keep civic-empowerment path behavior intact."
        },
        {
          "path": "frontend/src/utils/persianText.ts",
          "operation": "modify",
          "description": "Extend deterministic Persian text post-processing to better support multi-section structured answers (e.g., consistent newline collapsing and punctuation spacing) while preserving the canonical [ماما] prefix behavior. Avoid adding any content-dependent logging or unsafe transformations."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Make the self-improvement loop more explicit and robust by expanding privacy-preserving learning signals client-side and using aggregate stats/seed to bias deterministic angle/template selection over time (no raw private text stored).",
      "acceptanceCriteria": [
        "Private chat continues to automatically derive anonymized signals client-side and store them via storeAnonymizedSignal; no raw message text is ever sent through this learning-signal path.",
        "Backend continues to expose aggregate stats/seed (existing getAllCategoryStats / getAggregateVarietySeed) and does not introduce any endpoint that returns raw private message content.",
        "The frontend uses aggregate stats and/or aggregate seed to adjust deterministic selection among angles/templates (e.g., biasing toward underrepresented categories/angles), and this behavior is observable via changed template-key distribution across repeated test messages (without requiring user settings)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/privacyPreservingSignals.ts",
          "operation": "modify",
          "description": "Expand anonymized signal derivation heuristics to produce richer privacy-preserving categories (still non-reversible and aggregate-friendly) such as coarse intent buckets (question/help/decision), tone buckets, and structure preference hints. Ensure the function output contains only category strings + normalized numeric scores and never includes raw message text or identifiers."
        },
        {
          "path": "frontend/src/lib/mamaSelectionBias.ts",
          "operation": "create",
          "description": "Create a deterministic biasing helper that consumes aggregate anonymized category stats (from getAllCategoryStats) and/or aggregate variety seed to adjust selection among angles/templates (e.g., favor underrepresented angles/categories) while remaining deterministic and stable. Provide a small, testable API that returns weighted angle/template priorities without any storage of raw text."
        },
        {
          "path": "frontend/src/pages/ChatPage.tsx",
          "operation": "modify",
          "description": "Wire aggregate stats into the pipeline selection path (in addition to the existing public aggregateSeed): fetch aggregate category stats (useGetAllCategoryStats) and pass them into the Mama pipeline so angle/template selection can be deterministically biased without user settings. Keep private learning-signal submission automatic and ensure no raw private text is sent via the signal path."
        },
        {
          "path": "frontend/src/lib/mamaPipeline.ts",
          "operation": "modify",
          "description": "Accept optional aggregate anonymized stats (and/or derived bias signals) and apply them during deterministic angle/template selection for non-FAQ responses. Ensure the bias affects template-key distribution across repeated messages while maintaining anti-repetition guarantees and preserving the 7-step status flow returned to ChatPage."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add/extend query options support (e.g., refetchInterval/staleTime) for useGetAllCategoryStats (and any new aggregate selection inputs) so ChatPage can keep aggregate data reasonably fresh without adding new UI settings."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Extend TransparencyPage with high-level self-improvement indicators from aggregate stats (variety seed + top anonymized categories), preserving the existing 15s refresh and showing only anonymized/aggregate data.",
      "acceptanceCriteria": [
        "TransparencyPage shows at least: (1) the current aggregate variety seed value, and (2) a list of anonymized categories with counts/averages sourced from backend aggregate stats endpoints.",
        "The UI clearly contains only aggregate/anonymized data; no raw prompts, no per-user private message content, and no identifiers are displayed.",
        "Auto-refresh behavior (existing 15s refresh pattern) continues to work for the new indicators."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/TransparencyPage.tsx",
          "operation": "modify",
          "description": "Add a new self-improvement indicators section that queries and displays (1) the current aggregate variety seed (useGetAggregateVarietySeed) and (2) a small table/list of top anonymized categories from aggregate stats (useGetAllCategoryStats), including count/average fields as available. Reuse the existing 15s auto-refresh pattern for the new queries and include clear UI copy that the data is aggregate/anonymized only."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Ensure the aggregate seed and aggregate category stats hooks support the TransparencyPage refresh pattern (15s) and return safe fallbacks on actor unavailability/errors, without exposing any raw message content."
        }
      ]
    }
  ]
}